#+TITLE: Day 10, Part 1

#+begin_src jq :cmd-line -nR :in-file d10test.txt
{ "(": ")", "{": "}", "[": "]", "<": ">" } as $delim
| { ")": 3, "]": 57, "}": 1197, ">": 25137 } as $points
| [inputs/""
| [. + ["."], []]
| [recurse(
      . as [$i, $stack]
           | $i | [first]
           | if inside([$delim[]]) then
               if (.[]) == $delim[$stack | first] then
                 [$i[1:], $stack[1:]]
               else
                 [$i[1:], $stack[1:] + .]
               end
             else
               [$i[1:], . + $stack]
             end
          ; (first | length) > 0)] | last | last | map(select(inside($delim[]))) | first // empty] | map($points[.]) | add

#+end_src

#+RESULTS:
: 26397

#+begin_src jq :cmd-line -nR :in-file d10input.txt
{ "(": ")", "{": "}", "[": "]", "<": ">" } as $delim
| { ")": 3, "]": 57, "}": 1197, ">": 25137 } as $points
| [inputs/""
| [. + ["."], []]
| [recurse(
      . as [$i, $stack]
           | $i | [first]
           | if inside([$delim[]]) then
               if (.[]) == $delim[$stack | first] then
                 [$i[1:], $stack[1:]]
               else
                 [$i[1:], $stack[1:] + .]
               end
             else
               [$i[1:], . + $stack]
             end
          ; (first | length) > 0)]
    | last | last | map(select(inside($delim[])))  | first // empty] | map($points[.]) | add

#+end_src

#+RESULTS:
: 369105
